---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/haoge/Google Drive/My Drive/UnifiedDesignBasedInference/Cai(2015)Insurance/dataverse_files/Social_Networks_Insurance_Replicatio
> n/log.txt
  log type:  text
 opened on:   7 Jun 2022, 15:13:11

. cd "/Users/haoge/Google Drive/My Drive/UnifiedDesignBasedInference/Cai(2015)Insurance/dataverse_files/Social_Networks_Insurance_Replication/Data"
/Volumes/GoogleDrive/My Drive/UnifiedDesignBasedInference/Cai(2015)Insurance/dataverse_files/Social_Networks_Insurance_Replication/Data

. 
. clear

. 
. use 0422analysis, replace

. egen vilid = group(village)

. sum vilid, d

                       group(village)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              1
 5%            6              1
10%            8              1       Obs               4,902
25%           12              1       Sum of wgt.       4,902

50%           21                      Mean           24.26377
                        Largest       Std. dev.      13.49663
75%           37             47
90%           45             47       Variance       182.1591
95%           46             47       Skewness       .2309132
99%           47             47       Kurtosis       1.748195

. xi i.vilid
i.vilid           _Ivilid_1-47        (naturally coded; _Ivilid_1 omitted)

. 
. 
. **********************************************************1. Summary statistics************************************************************
. *1. Table 1, Mean and std 
. tabstat male age agpop educ ricearea_2010 rice_inc disaster_yes disaster_loss risk_averse disaster_prob understanding, stats (count mean sd)

   Stats |      male       age     agpop      educ  ric~2010  rice_inc  disas~es  disas~ss  risk_a~e  disast~b  unders~g
---------+--------------------------------------------------------------------------------------------------------------
       N |      4894      4893      4893      4841      4883      4789      4453      2518      4902      4902      4723
    Mean |  .9139763  51.49438  4.915185  1.191902  13.62975  74.11861  .6328318  27.50675  .1888209  33.63282  .4572518
      SD |  .2804277  12.03191  2.133418  .8533748  19.50735  27.67502   .482087  18.19906  .3133002  16.61935  .3030129
------------------------------------------------------------------------------------------------------------------------

. tabstat network_obs network_rate_preintensive network_twoside network_second, stats (count mean sd)

   Stats |  netwo~bs  netwo~ve  netwo~de  networ~d
---------+----------------------------------------
       N |      4588      4588      4588      4521
    Mean |  4.918265  .1649738  .0416921  .1678984
      SD |   .433588  .1896223   .098993   .117462
--------------------------------------------------

. tabstat indegree path_out_ind eigenvector, stats (count mean sd)

   Stats |  indegree  path_o~d  eigenv~r
---------+------------------------------
       N |      4588      4588      4588
    Mean |  3.244182  2.672834  .1437882
      SD |  1.912167  .8662739  .0831853
----------------------------------------

. tabstat takeup_survey, stats (count mean sd)

    Variable |         N      Mean        SD
-------------+------------------------------
takeup_sur~y |      4902  .4455324  .4970751
--------------------------------------------

. gen session = 0

. replace session = 11 if delay == 0 & intensive == 0
(1,079 real changes made)

. replace session = 12 if delay == 0 & intensive == 1
(1,096 real changes made)

. replace session = 21 if delay == 1 & intensive == 0
(1,374 real changes made)

. replace session = 22 if delay == 1 & intensive == 1
(1,353 real changes made)

. tab session

    session |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      1,079       22.01       22.01
         12 |      1,096       22.36       44.37
         21 |      1,374       28.03       72.40
         22 |      1,353       27.60      100.00
------------+-----------------------------------
      Total |      4,902      100.00

. tabstat takeup_survey if info_none == 1, stats (count mean sd) by(session) 

Summary for variables: takeup_survey
Group variable: session 

 session |         N      Mean        SD
---------+------------------------------
      11 |      1079  .3521779  .4778706
      12 |      1096  .5036496  .5002149
      21 |       657  .4429224  .4971099
      22 |       660  .4651515  .4991624
---------+------------------------------
   Total |      3492  .4381443  .4962302
----------------------------------------

. 
. *2. Table A1, Check randomization by sessions
. foreach x in male age agpop educ ricearea_2010 rice_inc disaster_yes disaster_loss{
  2.         oneway `x' session, b t
  3. } 

            |        Summary of Household
            |     Characteristics: Gender of
            |  Household Head, 1=male, 0=female
    session |        Mean   Std. dev.       Freq.
------------+------------------------------------
         11 |   .90824838   .28880887       1,079
         12 |   .92321755   .26636772       1,094
         21 |   .91034985   .28578405       1,372
         22 |   .91475167   .27935444       1,349
------------+------------------------------------
      Total |    .9139763    .2804277       4,894

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      .147683714      3   .049227905      0.63     0.5982
 Within groups      384.636338   4890   .078657738
------------------------------------------------------------------------
    Total           384.784021   4893   .078639694

Bartlett's equal-variances test: chi2(3) =   8.5282    Prob>chi2 = 0.036

                                Comparison of
    Household Characteristics: Gender of Household Head, 1=male, 0=female
                                  by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    .014969
         |      1.000
         |
      21 |    .002101   -.012868
         |      1.000      1.000
         |
      22 |    .006503   -.008466    .004402
         |      1.000      1.000      1.000

            |        Summary of Household
            |        Characteristics - Age
    session |        Mean   Std. dev.       Freq.
------------+------------------------------------
         11 |   51.489322   11.879081       1,077
         12 |   51.091408   12.173301       1,094
         21 |   51.723962    12.22709       1,373
         22 |   51.591549   11.841308       1,349
------------+------------------------------------
      Total |    51.49438   12.031907       4,893

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      262.783697      3   87.5945657      0.60     0.6118
 Within groups      707936.312   4889   144.801864
------------------------------------------------------------------------
    Total           708199.095   4892   144.766782

Bartlett's equal-variances test: chi2(3) =   2.0469    Prob>chi2 = 0.563

           Comparison of Household Characteristics - Age by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |   -.397915
         |      1.000
         |
      21 |     .23464    .632554
         |      1.000      1.000
         |
      22 |    .102227    .500142   -.132413
         |      1.000      1.000      1.000

            |        Summary of Household
            |  Characteristics - Household Size
    session |        Mean   Std. dev.       Freq.
------------+------------------------------------
         11 |   4.9024164    2.122472       1,076
         12 |   4.8558394   2.0935261       1,096
         21 |   4.9431901    2.202829       1,373
         22 |   4.9451039   2.1034736       1,348
------------+------------------------------------
      Total |    4.915185    2.133418       4,893

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      6.31889956      3   2.10629985      0.46     0.7084
 Within groups      22259.4829   4889   4.55297256
------------------------------------------------------------------------
    Total           22265.8018   4892   4.55147215

Bartlett's equal-variances test: chi2(3) =   4.2326    Prob>chi2 = 0.237

     Comparison of Household Characteristics - Household Size by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |   -.046577
         |      1.000
         |
      21 |    .040774    .087351
         |      1.000      1.000
         |
      22 |    .042688    .089264    .001914
         |      1.000      1.000      1.000

            |        Summary of Household
            |     Characteristics - Level of
            | Education, 0=illiteracy, 1=primary,
            |               2=secon
    session |        Mean   Std. dev.       Freq.
------------+------------------------------------
         11 |   1.1926692   .85852639       1,064
         12 |   1.2149446    .8502446       1,084
         21 |   1.1941176   .86581421       1,360
         22 |   1.1702926   .83932244       1,333
------------+------------------------------------
      Total |   1.1919025   .85337475       4,841

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      1.20533468      3   .401778226      0.55     0.6471
 Within groups      3523.51724   4837    .72845095
------------------------------------------------------------------------
    Total           3524.72258   4840   .728248467

Bartlett's equal-variances test: chi2(3) =   1.4069    Prob>chi2 = 0.704

                                Comparison of
Household Characteristics - Level of Education, 0=illiteracy, 1=primary, 2=secon
                                  by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    .022275
         |      1.000
         |
      21 |    .001448   -.020827
         |      1.000      1.000
         |
      22 |   -.022377   -.044652   -.023825
         |      1.000      1.000      1.000

            | Summary of Area of Rice Production
    session |        Mean   Std. dev.       Freq.
------------+------------------------------------
         11 |   13.667786   14.850037       1,075
         12 |    14.81074   25.653105       1,094
         21 |   13.041243   13.982457       1,368
         22 |   13.237623   21.680085       1,346
------------+------------------------------------
      Total |   13.629752   19.507349       4,883

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      2208.15948      3   736.053161      1.94     0.1216
 Within groups      1855571.81   4879    380.31806
------------------------------------------------------------------------
    Total           1857779.97   4882    380.53666

Bartlett's equal-variances test: chi2(3) = 610.5654    Prob>chi2 = 0.000

               Comparison of Area of Rice Production by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    1.14295
         |      1.000
         |
      21 |   -.626543    -1.7695
         |      1.000      0.152
         |
      22 |   -.430163   -1.57312     .19638
         |      1.000      0.285      1.000

            |  Summary of % of Household Income
            |        from Rice Production
    session |        Mean   Std. dev.       Freq.
------------+------------------------------------
         11 |   75.476865   26.745602       1,059
         12 |   74.766945   26.740674       1,077
         21 |   73.051128   28.465238       1,330
         22 |    73.57672   28.313366       1,323
------------+------------------------------------
      Total |   74.118605   27.675017       4,789

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      4310.45957      3   1436.81986      1.88     0.1312
 Within groups      3662850.17   4785    765.48593
------------------------------------------------------------------------
    Total           3667160.63   4788   765.906565

Bartlett's equal-variances test: chi2(3) =   8.4344    Prob>chi2 = 0.038

     Comparison of % of Household Income from Rice Production by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    -.70992
         |      1.000
         |
      21 |   -2.42574   -1.71582
         |      0.200      0.782
         |
      22 |   -1.90015   -1.19023    .525592
         |      0.575      1.000      1.000

            |  Summary of Any Disaster Happened
            |       Last Year, 1=yes, 0=no
    session |        Mean   Std. dev.       Freq.
------------+------------------------------------
         11 |   .62613982   .48407247         987
         12 |   .63509472   .48164375       1,003
         21 |   .63754045   .48090512       1,236
         22 |   .63162184   .48256137       1,227
------------+------------------------------------
      Total |    .6328318   .48208703       4,453

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      .078536798      3   .026178933      0.11     0.9528
 Within groups      1034.60145   4449   .232546967
------------------------------------------------------------------------
    Total           1034.67999   4452   .232407905

Bartlett's equal-variances test: chi2(3) =   0.0515    Prob>chi2 = 0.997

    Comparison of Any Disaster Happened Last Year, 1=yes, 0=no by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    .008955
         |      1.000
         |
      21 |    .011401    .002446
         |      1.000      1.000
         |
      22 |    .005482   -.003473   -.005919
         |      1.000      1.000      1.000

            |   Summary of Loss in Yield Due to
            |         Disaster Last Year
    session |        Mean   Std. dev.       Freq.
------------+------------------------------------
         11 |   27.041812    18.49829         574
         12 |   27.682692   18.116316         624
         21 |    27.60119   18.374037         672
         22 |   27.651235   17.861185         648
------------+------------------------------------
      Total |   27.506751   18.199065       2,518

                        Analysis of variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      162.917574      3   54.3058579      0.16     0.9208
 Within groups      833482.468   2514   331.536383
------------------------------------------------------------------------
    Total           833645.385   2517   331.205954

Bartlett's equal-variances test: chi2(3) =   0.9046    Prob>chi2 = 0.824

       Comparison of Loss in Yield Due to Disaster Last Year by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |     .64088
         |      1.000
         |
      21 |    .559379   -.081502
         |      1.000      1.000
         |
      22 |    .609423   -.031458    .050044
         |      1.000      1.000      1.000

. 
. **********************************************************2.Intensive session effect************************************************************
. gen inter_intensive_educ = intensive*educ_good

. gen inter_intensive_age = intensive*age
(9 missing values generated)

. gen inter_intensive_exp = intensive*insurance_repay

. gen inter_intensive_risk = intensive*risk_averse

. gen inter_intensive_day = intensive*day 

. 
. local outputfile0 Table2.xls

. *intensive session effect: table2, col 1
. reg takeup_survey intensive male age agpop ricearea_2010 literacy _Ivilid* if delay == 0, cluster(address)

Linear regression                               Number of obs     =      2,137
                                                F(48, 172)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1251
                                                Root MSE          =     .46905

                               (Std. err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------
              |               Robust
takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    intensive |   .1408242   .0260309     5.41   0.000     .0894431    .1922054
         male |   .0407053   .0474814     0.86   0.392    -.0530159    .1344265
          age |   .0017669   .0010681     1.65   0.100    -.0003415    .0038752
        agpop |  -.0029449   .0051839    -0.57   0.571    -.0131771    .0072873
ricearea_2010 |   .0007886   .0007542     1.05   0.297       -.0007    .0022772
     literacy |    .083205   .0269222     3.09   0.002     .0300646    .1363454
    _Ivilid_2 |  -.4123784    .105623    -3.90   0.000    -.6208625   -.2038943
    _Ivilid_3 |  -.1940895   .0321591    -6.04   0.000    -.2575668   -.1306122
    _Ivilid_4 |  -.2424232   .0365943    -6.62   0.000     -.314655   -.1701914
    _Ivilid_5 |  -.1673066   .1532014    -1.09   0.276    -.4697034    .1350903
    _Ivilid_6 |    .233148    .027189     8.58   0.000     .1794809    .2868151
    _Ivilid_7 |  -.2599335   .0585243    -4.44   0.000    -.3754518   -.1444152
    _Ivilid_8 |  -.2345645    .095587    -2.45   0.015    -.4232391     -.04589
    _Ivilid_9 |  -.2557939   .0970368    -2.64   0.009    -.4473302   -.0642576
   _Ivilid_10 |  -.2849145   .1163177    -2.45   0.015    -.5145083   -.0553206
   _Ivilid_11 |  -.1285052   .0833695    -1.54   0.125    -.2930644    .0360539
   _Ivilid_12 |   .0229908   .1127212     0.20   0.839    -.1995041    .2454857
   _Ivilid_13 |   .0009335   .0830125     0.01   0.991    -.1629208    .1647878
   _Ivilid_14 |  -.1539832   .1051269    -1.46   0.145    -.3614882    .0535219
   _Ivilid_15 |   .1156739   .0673712     1.72   0.088    -.0173068    .2486546
   _Ivilid_16 |  -.5002053   .0111914   -44.70   0.000    -.5222955    -.478115
   _Ivilid_17 |  -.4074481   .0673014    -6.05   0.000    -.5402911   -.2746051
   _Ivilid_18 |  -.0584232   .1461399    -0.40   0.690    -.3468818    .2300355
   _Ivilid_19 |  -.2921655   .0701459    -4.17   0.000    -.4306232   -.1537078
   _Ivilid_20 |  -.1324631   .1225829    -1.08   0.281    -.3744236    .1094973
   _Ivilid_21 |  -.2456389   .0579806    -4.24   0.000    -.3600841   -.1311937
   _Ivilid_22 |  -.2850252   .1693864    -1.68   0.094     -.619369    .0493186
   _Ivilid_23 |  -.2555737   .1073237    -2.38   0.018    -.4674148   -.0437327
   _Ivilid_24 |  -.1181014   .0655432    -1.80   0.073     -.247474    .0112711
   _Ivilid_25 |   .0228554   .0748461     0.31   0.760    -.1248798    .1705905
   _Ivilid_26 |     .09435   .1124886     0.84   0.403    -.1276859    .3163858
   _Ivilid_27 |  -.1907178   .0958798    -1.99   0.048    -.3799704   -.0014651
   _Ivilid_28 |   .0683045   .0835142     0.82   0.415    -.0965402    .2331492
   _Ivilid_29 |   -.381898   .0797254    -4.79   0.000    -.5392642   -.2245319
   _Ivilid_30 |  -.2715477   .0871399    -3.12   0.002     -.443549   -.0995464
   _Ivilid_31 |   .0914096   .0185407     4.93   0.000      .054813    .1280062
   _Ivilid_32 |   .2450654   .1094809     2.24   0.026     .0289662    .4611645
   _Ivilid_33 |   .0920943   .1357091     0.68   0.498    -.1757754    .3599641
   _Ivilid_34 |  -.2613101   .2199718    -1.19   0.237     -.695502    .1728818
   _Ivilid_35 |  -.1738035   .0143662   -12.10   0.000    -.2021604   -.1454467
   _Ivilid_36 |  -.1826537   .0427178    -4.28   0.000    -.2669723   -.0983351
   _Ivilid_37 |  -.2841952   .0867025    -3.28   0.001    -.4553332   -.1130573
   _Ivilid_38 |   .0587897   .0270967     2.17   0.031     .0053048    .1122745
   _Ivilid_39 |  -.4263741   .0295278   -14.44   0.000    -.4846575   -.3680907
   _Ivilid_40 |  -.1489744   .1066803    -1.40   0.164    -.3595456    .0615967
   _Ivilid_41 |  -.0932542    .024823    -3.76   0.000    -.1422511   -.0442574
   _Ivilid_42 |  -.3919875   .0352782   -11.11   0.000    -.4616214   -.3223535
   _Ivilid_43 |  -.1611961   .0503166    -3.20   0.002    -.2605136   -.0618786
   _Ivilid_44 |  -.4803191   .0483564    -9.93   0.000    -.5757674   -.3848708
   _Ivilid_45 |  -.0252228   .0967524    -0.26   0.795    -.2161977    .1657521
   _Ivilid_46 |  -.3062709   .0642418    -4.77   0.000    -.4330747    -.179467
   _Ivilid_47 |  -.2889457   .1000622    -2.89   0.004    -.4864536   -.0914378
        _cons |   .3634212   .0863035     4.21   0.000     .1930709    .5337714
-------------------------------------------------------------------------------

. outreg2 using `outputfile0'
/Users/haoge/Library/Application Support/Stata/ado/plus/o/outreg2.ado
Table2.xls
dir : seeout

. local outputfile1 TableA3.xls

. *heterogeneity: table A3
. reg takeup_survey intensive inter_intensive_age male age agpop ricearea_2010 literacy _Ivilid* if delay == 0, cluster(address)

Linear regression                               Number of obs     =      2,137
                                                F(49, 172)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1251
                                                Root MSE          =     .46916

                                     (Std. err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          intensive |    .135688   .0965379     1.41   0.162    -.0548635    .3262395
inter_intensive_age |   .0001001   .0018819     0.05   0.958    -.0036145    .0038147
               male |   .0407791   .0475616     0.86   0.392    -.0531004    .1346587
                age |   .0017156   .0014195     1.21   0.228    -.0010864    .0045175
              agpop |   -.002945   .0051857    -0.57   0.571    -.0131808    .0072909
      ricearea_2010 |   .0007894   .0007554     1.05   0.297    -.0007016    .0022803
           literacy |   .0831936    .026953     3.09   0.002     .0299924    .1363947
          _Ivilid_2 |   -.412183   .1054812    -3.91   0.000    -.6203872   -.2039788
          _Ivilid_3 |   -.194016    .032196    -6.03   0.000    -.2575661   -.1304658
          _Ivilid_4 |  -.2422795   .0368003    -6.58   0.000    -.3149178   -.1696411
          _Ivilid_5 |  -.1673056   .1532209    -1.09   0.276    -.4697409    .1351297
          _Ivilid_6 |   .2330991   .0272657     8.55   0.000     .1792807    .2869175
          _Ivilid_7 |  -.2598394   .0583748    -4.45   0.000    -.3750627   -.1446162
          _Ivilid_8 |  -.2344689   .0956022    -2.45   0.015    -.4231735   -.0457643
          _Ivilid_9 |  -.2558067   .0971018    -2.63   0.009    -.4474713   -.0641421
         _Ivilid_10 |  -.2849409   .1162989    -2.45   0.015    -.5144976   -.0553841
         _Ivilid_11 |  -.1285413   .0834029    -1.54   0.125    -.2931663    .0360837
         _Ivilid_12 |   .0229836   .1127764     0.20   0.839    -.1996204    .2455875
         _Ivilid_13 |   .0009829   .0829497     0.01   0.991    -.1627475    .1647133
         _Ivilid_14 |  -.1538872   .1051765    -1.46   0.145    -.3614902    .0537157
         _Ivilid_15 |   .1154904   .0672117     1.72   0.088    -.0171756    .2481564
         _Ivilid_16 |  -.5002982   .0112172   -44.60   0.000    -.5224393   -.4781572
         _Ivilid_17 |  -.4074899    .067471    -6.04   0.000    -.5406676   -.2743122
         _Ivilid_18 |  -.0584891   .1461442    -0.40   0.689    -.3469561    .2299779
         _Ivilid_19 |  -.2922491   .0703526    -4.15   0.000    -.4311146   -.1533835
         _Ivilid_20 |  -.1323332   .1227509    -1.08   0.283    -.3746253     .109959
         _Ivilid_21 |  -.2457448   .0580445    -4.23   0.000     -.360316   -.1311737
         _Ivilid_22 |  -.2852809   .1692708    -1.69   0.094    -.6193964    .0488347
         _Ivilid_23 |  -.2557373   .1070938    -2.39   0.018    -.4671246   -.0443501
         _Ivilid_24 |  -.1180182   .0658386    -1.79   0.075    -.2479739    .0119375
         _Ivilid_25 |   .0227171   .0748459     0.30   0.762    -.1250176    .1704519
         _Ivilid_26 |   .0942708   .1124979     0.84   0.403    -.1277835     .316325
         _Ivilid_27 |  -.1904067   .0953666    -2.00   0.047    -.3786463   -.0021672
         _Ivilid_28 |   .0682927   .0835144     0.82   0.415    -.0965524    .2331378
         _Ivilid_29 |  -.3820367   .0798811    -4.78   0.000    -.5397102   -.2243632
         _Ivilid_30 |  -.2714478   .0872485    -3.11   0.002    -.4436634   -.0992322
         _Ivilid_31 |   .0915044   .0186823     4.90   0.000     .0546283    .1283805
         _Ivilid_32 |   .2451799   .1095363     2.24   0.026     .0289714    .4613883
         _Ivilid_33 |    .092161   .1357802     0.68   0.498     -.175849     .360171
         _Ivilid_34 |  -.2613916   .2201255    -1.19   0.237    -.6958868    .1731035
         _Ivilid_35 |  -.1734935   .0152506   -11.38   0.000     -.203596    -.143391
         _Ivilid_36 |  -.1826065   .0428126    -4.27   0.000    -.2671123   -.0981007
         _Ivilid_37 |  -.2842094   .0866775    -3.28   0.001     -.455298   -.1131208
         _Ivilid_38 |   .0586903   .0271162     2.16   0.032     .0051669    .1122136
         _Ivilid_39 |  -.4264652   .0294898   -14.46   0.000    -.4846736   -.3682567
         _Ivilid_40 |  -.1489666   .1066756    -1.40   0.164    -.3595285    .0615952
         _Ivilid_41 |  -.0932067   .0247556    -3.77   0.000    -.1420706   -.0443429
         _Ivilid_42 |  -.3919683   .0353037   -11.10   0.000    -.4616525   -.3222841
         _Ivilid_43 |  -.1611158   .0502621    -3.21   0.002    -.2603257   -.0619058
         _Ivilid_44 |  -.4803038   .0483521    -9.93   0.000    -.5757436   -.3848639
         _Ivilid_45 |  -.0251455   .0967891    -0.26   0.795    -.2161929     .165902
         _Ivilid_46 |  -.3061741   .0644698    -4.75   0.000     -.433428   -.1789203
         _Ivilid_47 |  -.2890293   .1000066    -2.89   0.004    -.4864275   -.0916311
              _cons |   .3659834   .0965421     3.79   0.000     .1754236    .5565431
-------------------------------------------------------------------------------------

. test intensive inter_intensive_age

 ( 1)  intensive = 0
 ( 2)  inter_intensive_age = 0

       F(  2,   172) =   14.86
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. reg takeup_survey intensive inter_intensive_educ male age agpop ricearea_2010 educ_good _Ivilid* if delay == 0, cluster(address)

Linear regression                               Number of obs     =      2,161
                                                F(49, 172)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1279
                                                Root MSE          =      .4682

                                      (Std. err. adjusted for 173 clusters in address)
--------------------------------------------------------------------------------------
                     |               Robust
       takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
           intensive |   .1510852   .0346826     4.36   0.000     .0826269    .2195435
inter_intensive_educ |  -.0210208   .0480495    -0.44   0.662    -.1158635    .0738218
                male |   .0439415   .0469062     0.94   0.350    -.0486444    .1365274
                 age |   .0018527   .0010408     1.78   0.077    -.0002016     .003907
               agpop |   -.002155   .0053718    -0.40   0.689    -.0127582    .0084482
       ricearea_2010 |   .0007734   .0007665     1.01   0.314    -.0007396    .0022864
           educ_good |   .0938914   .0342651     2.74   0.007     .0262573    .1615256
           _Ivilid_2 |  -.3924125   .1010118    -3.88   0.000    -.5917949     -.19303
           _Ivilid_3 |  -.1828188   .0328747    -5.56   0.000    -.2477087    -.117929
           _Ivilid_4 |  -.2470334   .0457009    -5.41   0.000    -.3372401   -.1568266
           _Ivilid_5 |  -.1664581   .1473993    -1.13   0.260    -.4574025    .1244864
           _Ivilid_6 |   .2263846   .0213732    10.59   0.000      .184197    .2685721
           _Ivilid_7 |  -.2635023    .058089    -4.54   0.000    -.3781614   -.1488432
           _Ivilid_8 |  -.2400628   .0962245    -2.49   0.014    -.4299958   -.0501299
           _Ivilid_9 |   -.264666   .0934788    -2.83   0.005    -.4491793   -.0801528
          _Ivilid_10 |  -.2782901   .1129773    -2.46   0.015    -.5012906   -.0552896
          _Ivilid_11 |  -.1278523   .0823421    -1.55   0.122    -.2903835    .0346789
          _Ivilid_12 |   .0299951   .1152061     0.26   0.795    -.1974047    .2573949
          _Ivilid_13 |   .0005866   .0854602     0.01   0.995    -.1680991    .1692723
          _Ivilid_14 |  -.1493379   .1045371    -1.43   0.155    -.3556787     .057003
          _Ivilid_15 |    .109511   .0705583     1.55   0.122    -.0297606    .2487826
          _Ivilid_16 |  -.5003261   .0117232   -42.68   0.000     -.523466   -.4771861
          _Ivilid_17 |  -.3987804   .0689677    -5.78   0.000    -.5349124   -.2626484
          _Ivilid_18 |    -.05636   .1396582    -0.40   0.687    -.3320246    .2193047
          _Ivilid_19 |   -.291899   .0672791    -4.34   0.000    -.4246981      -.1591
          _Ivilid_20 |   -.120443   .1205155    -1.00   0.319    -.3583227    .1174367
          _Ivilid_21 |  -.2370603   .0584211    -4.06   0.000    -.3523749   -.1217456
          _Ivilid_22 |  -.2773728   .1708986    -1.62   0.106    -.6147014    .0599558
          _Ivilid_23 |  -.2283365   .1226803    -1.86   0.064    -.4704894    .0138163
          _Ivilid_24 |  -.1246784   .0631782    -1.97   0.050    -.2493828    .0000261
          _Ivilid_25 |   .0202698   .0774014     0.26   0.794     -.132509    .1730487
          _Ivilid_26 |   .0900335   .1100005     0.82   0.414    -.1270912    .3071583
          _Ivilid_27 |  -.1937836   .0935729    -2.07   0.040    -.3784828   -.0090844
          _Ivilid_28 |   .0676231   .0748222     0.90   0.367    -.0800649    .2153111
          _Ivilid_29 |  -.3610157    .088833    -4.06   0.000     -.536359   -.1856725
          _Ivilid_30 |  -.2768951   .0880994    -3.14   0.002    -.4507903   -.1029999
          _Ivilid_31 |   .1158721   .0205359     5.64   0.000     .0753373     .156407
          _Ivilid_32 |   .2410382   .1062964     2.27   0.025     .0312249    .4508515
          _Ivilid_33 |   .0672735   .1323426     0.51   0.612    -.1939513    .3284983
          _Ivilid_34 |  -.2633949   .2278987    -1.16   0.249    -.7132333    .1864434
          _Ivilid_35 |  -.1762989   .0142781   -12.35   0.000    -.2044817    -.148116
          _Ivilid_36 |  -.1748299   .0352656    -4.96   0.000     -.244439   -.1052207
          _Ivilid_37 |  -.2791964   .0863922    -3.23   0.001    -.4497218    -.108671
          _Ivilid_38 |   .0577737    .027181     2.13   0.035     .0041224    .1114251
          _Ivilid_39 |  -.4030645   .0646689    -6.23   0.000    -.5307113   -.2754177
          _Ivilid_40 |  -.1403773   .1056811    -1.33   0.186    -.3489761    .0682216
          _Ivilid_41 |  -.0939161   .0228419    -4.11   0.000    -.1390026   -.0488297
          _Ivilid_42 |  -.3804682   .0377401   -10.08   0.000    -.4549617   -.3059747
          _Ivilid_43 |    -.16672   .0477162    -3.49   0.001    -.2609048   -.0725352
          _Ivilid_44 |  -.4787976   .0476459   -10.05   0.000    -.5728435   -.3847517
          _Ivilid_45 |  -.0199414   .1002981    -0.20   0.843     -.217915    .1780323
          _Ivilid_46 |  -.3025909   .0645808    -4.69   0.000    -.4300639    -.175118
          _Ivilid_47 |  -.2712112   .0957402    -2.83   0.005    -.4601882   -.0822343
               _cons |   .3790967   .0840263     4.51   0.000     .2132413    .5449521
--------------------------------------------------------------------------------------

. test intensive inter_intensive_educ

 ( 1)  intensive = 0
 ( 2)  inter_intensive_educ = 0

       F(  2,   172) =   15.39
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. reg takeup_survey intensive inter_intensive_exp insurance_repay male age agpop ricearea_2010 literacy _Ivilid* if delay == 0, cluster(address)

Linear regression                               Number of obs     =      2,137
                                                F(50, 172)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1269
                                                Root MSE          =     .46879

                                     (Std. err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          intensive |    .127858   .0327611     3.90   0.000     .0631925    .1925235
inter_intensive_exp |    .033493   .0455258     0.74   0.463    -.0563682    .1233542
    insurance_repay |   .0237274    .032684     0.73   0.469    -.0407861    .0882408
               male |   .0400201   .0471824     0.85   0.398     -.053111    .1331511
                age |   .0017503    .001075     1.63   0.105    -.0003715    .0038721
              agpop |  -.0031501   .0051945    -0.61   0.545    -.0134033     .007103
      ricearea_2010 |   .0007556   .0007297     1.04   0.302    -.0006847    .0021959
           literacy |   .0829524   .0268016     3.10   0.002     .0300499    .1358548
          _Ivilid_2 |  -.4107583   .1090766    -3.77   0.000    -.6260592   -.1954573
          _Ivilid_3 |  -.1914784   .0343574    -5.57   0.000    -.2592948    -.123662
          _Ivilid_4 |  -.2465776   .0360918    -6.83   0.000    -.3178174   -.1753377
          _Ivilid_5 |  -.1667951   .1589223    -1.05   0.295    -.4804842    .1468941
          _Ivilid_6 |   .2298177   .0326422     7.04   0.000     .1653868    .2942486
          _Ivilid_7 |  -.2664594   .0594588    -4.48   0.000    -.3838222   -.1490965
          _Ivilid_8 |  -.2404683   .0962192    -2.50   0.013    -.4303907   -.0505459
          _Ivilid_9 |  -.2604943   .0934967    -2.79   0.006     -.445043   -.0759455
         _Ivilid_10 |  -.2895084   .1160684    -2.49   0.014    -.5186102   -.0604066
         _Ivilid_11 |  -.1302685   .0833145    -1.56   0.120     -.294719    .0341821
         _Ivilid_12 |   .0171495   .1132497     0.15   0.880    -.2063888    .2406877
         _Ivilid_13 |  -.0016364   .0822256    -0.02   0.984    -.1639376    .1606647
         _Ivilid_14 |  -.1534508   .1060719    -1.45   0.150     -.362821    .0559194
         _Ivilid_15 |   .1013376   .0690912     1.47   0.144    -.0350382    .2377134
         _Ivilid_16 |  -.5141202   .0158828   -32.37   0.000    -.5454704     -.48277
         _Ivilid_17 |  -.4052326   .0693938    -5.84   0.000    -.5422057   -.2682594
         _Ivilid_18 |  -.0632822   .1436794    -0.44   0.660    -.3468841    .2203198
         _Ivilid_19 |  -.2894079   .0726712    -3.98   0.000      -.43285   -.1459657
         _Ivilid_20 |  -.1235664   .1222996    -1.01   0.314    -.3649678     .117835
         _Ivilid_21 |  -.2362791   .0596984    -3.96   0.000     -.354115   -.1184432
         _Ivilid_22 |  -.2838984    .167139    -1.70   0.091    -.6138061    .0460093
         _Ivilid_23 |  -.2629378   .1106788    -2.38   0.019    -.4814014   -.0444743
         _Ivilid_24 |  -.1200624   .0675166    -1.78   0.077    -.2533301    .0132053
         _Ivilid_25 |   .0124229   .0753865     0.16   0.869    -.1363789    .1612247
         _Ivilid_26 |   .0873795    .114238     0.76   0.445    -.1381094    .3128684
         _Ivilid_27 |  -.1986934   .1000027    -1.99   0.049     -.396084   -.0013028
         _Ivilid_28 |   .0704438   .0824269     0.85   0.394    -.0922547    .2331424
         _Ivilid_29 |  -.3768161    .079414    -4.74   0.000    -.5335676   -.2200646
         _Ivilid_30 |  -.2713781   .0877751    -3.09   0.002    -.4446332    -.098123
         _Ivilid_31 |    .079448   .0216503     3.67   0.000     .0367134    .1221826
         _Ivilid_32 |   .2304637   .1126863     2.05   0.042     .0080376    .4528899
         _Ivilid_33 |   .0845458   .1326105     0.64   0.525    -.1772077    .3462993
         _Ivilid_34 |   -.264365   .2183171    -1.21   0.228    -.6952906    .1665607
         _Ivilid_35 |  -.1784256   .0148203   -12.04   0.000    -.2076788   -.1491725
         _Ivilid_36 |   -.185717   .0434438    -4.27   0.000    -.2714686   -.0999655
         _Ivilid_37 |  -.2812058   .0876131    -3.21   0.002    -.4541412   -.1082705
         _Ivilid_38 |   .0542065   .0277862     1.95   0.053    -.0006394    .1090524
         _Ivilid_39 |  -.4257215   .0306013   -13.91   0.000     -.486124    -.365319
         _Ivilid_40 |  -.1438472   .1082382    -1.33   0.186    -.3574934     .069799
         _Ivilid_41 |  -.0831759   .0231377    -3.59   0.000    -.1288463   -.0375054
         _Ivilid_42 |  -.3855601   .0369485   -10.44   0.000    -.4584909   -.3126294
         _Ivilid_43 |   -.166166   .0546469    -3.04   0.003     -.274031    -.058301
         _Ivilid_44 |  -.4836683   .0472747   -10.23   0.000    -.5769815    -.390355
         _Ivilid_45 |  -.0243233    .098387    -0.25   0.805    -.2185247    .1698782
         _Ivilid_46 |  -.3051374    .064385    -4.74   0.000    -.4322238   -.1780509
         _Ivilid_47 |  -.2843394   .1016203    -2.80   0.006    -.4849228    -.083756
              _cons |   .3570586   .0871084     4.10   0.000     .1851195    .5289977
-------------------------------------------------------------------------------------

. test intensive inter_intensive_exp

 ( 1)  intensive = 0
 ( 2)  inter_intensive_exp = 0

       F(  2,   172) =   15.32
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. reg takeup_survey intensive inter_intensive_risk risk_averse male age agpop ricearea_2010 literacy _Ivilid* if delay == 0, cluster(address)

Linear regression                               Number of obs     =      2,137
                                                F(50, 172)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1254
                                                Root MSE          =     .46921

                                      (Std. err. adjusted for 173 clusters in address)
--------------------------------------------------------------------------------------
                     |               Robust
       takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
           intensive |   .1308669   .0303061     4.32   0.000     .0710471    .1906868
inter_intensive_risk |    .048197    .070155     0.69   0.493    -.0902786    .1866726
         risk_averse |   -.021768   .0483363    -0.45   0.653    -.1171767    .0736407
                male |    .040878   .0474395     0.86   0.390    -.0527606    .1345166
                 age |    .001785    .001058     1.69   0.093    -.0003033    .0038732
               agpop |   -.003089   .0052036    -0.59   0.554    -.0133602    .0071821
       ricearea_2010 |   .0007857    .000754     1.04   0.299    -.0007026     .002274
            literacy |   .0836422   .0269633     3.10   0.002     .0304207    .1368637
           _Ivilid_2 |  -.4145949    .106718    -3.88   0.000    -.6252406   -.2039493
           _Ivilid_3 |  -.1933038   .0321582    -6.01   0.000    -.2567793   -.1298284
           _Ivilid_4 |  -.2452053   .0370455    -6.62   0.000    -.3183276   -.1720829
           _Ivilid_5 |  -.1668373   .1530659    -1.09   0.277    -.4689668    .1352921
           _Ivilid_6 |   .2342821   .0300929     7.79   0.000     .1748832    .2936809
           _Ivilid_7 |   -.260182   .0596918    -4.36   0.000    -.3780047   -.1423592
           _Ivilid_8 |  -.2334797   .0963776    -2.42   0.016    -.4237148   -.0432446
           _Ivilid_9 |   -.255177   .0957876    -2.66   0.008    -.4442476   -.0661064
          _Ivilid_10 |  -.2837514   .1173568    -2.42   0.017    -.5153964   -.0521064
          _Ivilid_11 |  -.1284165   .0821566    -1.56   0.120    -.2905814    .0337484
          _Ivilid_12 |    .022195   .1136482     0.20   0.845    -.2021298    .2465198
          _Ivilid_13 |   .0012985   .0832527     0.02   0.988      -.16303     .165627
          _Ivilid_14 |  -.1526796   .1064636    -1.43   0.153    -.3628229    .0574637
          _Ivilid_15 |   .1177303   .0691396     1.70   0.090     -.018741    .2542016
          _Ivilid_16 |  -.5006428    .014323   -34.95   0.000    -.5289142   -.4723713
          _Ivilid_17 |  -.4069829   .0676874    -6.01   0.000    -.5405879   -.2733779
          _Ivilid_18 |  -.0565111   .1464135    -0.39   0.700    -.3455098    .2324875
          _Ivilid_19 |  -.2926953   .0707314    -4.14   0.000    -.4323087    -.153082
          _Ivilid_20 |  -.1320283   .1223206    -1.08   0.282    -.3734711    .1094144
          _Ivilid_21 |  -.2451061   .0588311    -4.17   0.000    -.3612301   -.1289822
          _Ivilid_22 |  -.2848646   .1699676    -1.68   0.096    -.6203555    .0506263
          _Ivilid_23 |  -.2520551   .1062719    -2.37   0.019    -.4618201   -.0422901
          _Ivilid_24 |  -.1183698    .065652    -1.80   0.073    -.2479571    .0112176
          _Ivilid_25 |   .0251852   .0742234     0.34   0.735    -.1213208    .1716912
          _Ivilid_26 |   .0959508   .1132528     0.85   0.398    -.1275934     .319495
          _Ivilid_27 |  -.1903185   .0957209    -1.99   0.048    -.3792574   -.0013797
          _Ivilid_28 |   .0697788   .0839153     0.83   0.407    -.0958577    .2354152
          _Ivilid_29 |  -.3819315   .0821159    -4.65   0.000     -.544016   -.2198469
          _Ivilid_30 |  -.2724462   .0878759    -3.10   0.002    -.4459002   -.0989923
          _Ivilid_31 |   .0916489   .0204571     4.48   0.000     .0512697    .1320281
          _Ivilid_32 |   .2417287   .1113355     2.17   0.031     .0219688    .4614885
          _Ivilid_33 |    .093216   .1355574     0.69   0.493    -.1743542    .3607862
          _Ivilid_34 |  -.2625838   .2203914    -1.19   0.235    -.6976037    .1724362
          _Ivilid_35 |  -.1706294   .0158532   -10.76   0.000    -.2019212   -.1393375
          _Ivilid_36 |  -.1822766   .0440481    -4.14   0.000     -.269221   -.0953322
          _Ivilid_37 |  -.2834976   .0872374    -3.25   0.001    -.4556914   -.1113038
          _Ivilid_38 |    .061783   .0287699     2.15   0.033     .0049955    .1185706
          _Ivilid_39 |  -.4253013    .029585   -14.38   0.000    -.4836978   -.3669049
          _Ivilid_40 |  -.1489616   .1075296    -1.39   0.168    -.3612091    .0632859
          _Ivilid_41 |  -.0908835   .0251546    -3.61   0.000    -.1405351   -.0412319
          _Ivilid_42 |  -.3916204   .0375276   -10.44   0.000    -.4656944   -.3175465
          _Ivilid_43 |  -.1593396   .0520894    -3.06   0.003    -.2621564   -.0565227
          _Ivilid_44 |  -.4820108   .0495546    -9.73   0.000    -.5798243   -.3841973
          _Ivilid_45 |  -.0245082   .0971386    -0.25   0.801    -.2162454    .1672291
          _Ivilid_46 |  -.3069724   .0651136    -4.71   0.000    -.4354969   -.1784479
          _Ivilid_47 |  -.2873025    .101752    -2.82   0.005    -.4881459   -.0864592
               _cons |   .3667824   .0870733     4.21   0.000     .1949125    .5386522
--------------------------------------------------------------------------------------

. test intensive inter_intensive_risk

 ( 1)  intensive = 0
 ( 2)  inter_intensive_risk = 0

       F(  2,   172) =   15.01
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. reg takeup_survey intensive inter_intensive_day day male age agpop ricearea_2010 literacy _Ivilid* if delay == 0, cluster(address)

Linear regression                               Number of obs     =      2,137
                                                F(50, 172)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1274
                                                Root MSE          =     .46867

                                     (Std. err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          intensive |   .1960568    .057646     3.40   0.001     .0822721    .3098416
inter_intensive_day |  -.0027918   .0023436    -1.19   0.235    -.0074177    .0018341
                day |  -.0139064   .0111612    -1.25   0.214     -.035937    .0081242
               male |   .0355823   .0475437     0.75   0.455    -.0582619    .1294266
                age |   .0018364    .001061     1.73   0.085    -.0002578    .0039305
              agpop |    -.00329   .0051889    -0.63   0.527    -.0135321    .0069521
      ricearea_2010 |   .0008123   .0007739     1.05   0.295    -.0007152    .0023399
           literacy |   .0842239   .0267662     3.15   0.002     .0313913    .1370565
          _Ivilid_2 |  -.6675013   .2147038    -3.11   0.002    -1.091295   -.2437077
          _Ivilid_3 |  -.3609265   .1263957    -2.86   0.005    -.6104131     -.11144
          _Ivilid_4 |  -.5926824   .2567715    -2.31   0.022    -1.099511   -.0858534
          _Ivilid_5 |  -.1518918   .1522394    -1.00   0.320    -.4523899    .1486062
          _Ivilid_6 |    .295198   .0520723     5.67   0.000     .1924149    .3979811
          _Ivilid_7 |  -.1438379   .0980409    -1.47   0.144    -.3373562    .0496804
          _Ivilid_8 |  -.2812499   .0979928    -2.87   0.005    -.4746733   -.0878266
          _Ivilid_9 |  -.3287199   .1114428    -2.95   0.004    -.5486914   -.1087483
         _Ivilid_10 |    .006914   .2369532     0.03   0.977    -.4607966    .4746245
         _Ivilid_11 |  -.5091777   .2900389    -1.76   0.081    -1.081672    .0633163
         _Ivilid_12 |  -.4046711   .3339328    -1.21   0.227    -1.063805    .2544629
         _Ivilid_13 |  -.0811732   .1033786    -0.79   0.433    -.2852273     .122881
         _Ivilid_14 |  -.4096972   .2186097    -1.87   0.063    -.8412005     .021806
         _Ivilid_15 |  -.0355061   .1289692    -0.28   0.783    -.2900723    .2190601
         _Ivilid_16 |    -.51549   .0157237   -32.78   0.000    -.5465264   -.4844537
         _Ivilid_17 |  -.5902983   .1523977    -3.87   0.000    -.8911088   -.2894878
         _Ivilid_18 |   -.006259   .1320735    -0.05   0.962    -.2669526    .2544347
         _Ivilid_19 |  -.4140871   .1055201    -3.92   0.000    -.6223682   -.2058061
         _Ivilid_20 |  -.4520337   .2626803    -1.72   0.087    -.9705257    .0664583
         _Ivilid_21 |  -.4467304   .1537418    -2.91   0.004     -.750194   -.1432668
         _Ivilid_22 |  -.2203788   .1809736    -1.22   0.225    -.5775939    .1368362
         _Ivilid_23 |  -.6353559   .2970019    -2.14   0.034    -1.221594   -.0491181
         _Ivilid_24 |  -.2338178   .1044211    -2.24   0.026    -.4399296    -.027706
         _Ivilid_25 |  -.1136664   .1237002    -0.92   0.359    -.3578322    .1304995
         _Ivilid_26 |    .198758   .1317788     1.51   0.133    -.0613538    .4588699
         _Ivilid_27 |   -.297662   .1261444    -2.36   0.019    -.5466523   -.0486716
         _Ivilid_28 |  -.0510531   .1196616    -0.43   0.670    -.2872474    .1851413
         _Ivilid_29 |  -.6095527   .1839694    -3.31   0.001    -.9726811   -.2464243
         _Ivilid_30 |  -.6799939   .3107645    -2.19   0.030    -1.293397   -.0665907
         _Ivilid_31 |    .007281   .0662187     0.11   0.913     -.123425    .1379869
         _Ivilid_32 |   .5315253   .2256122     2.36   0.020     .0862002    .9768505
         _Ivilid_33 |  -.0785624   .1789212    -0.44   0.661    -.4317263    .2746016
         _Ivilid_34 |   -.237098   .2257644    -1.05   0.295    -.6827235    .2085276
         _Ivilid_35 |   .1127069   .1998872     0.56   0.574     -.281841    .5072547
         _Ivilid_36 |  -.5810176   .2908487    -2.00   0.047     -1.15511   -.0069253
         _Ivilid_37 |  -.5718707   .2274989    -2.51   0.013     -1.02092   -.1228216
         _Ivilid_38 |   .0908056   .0360795     2.52   0.013     .0195901    .1620211
         _Ivilid_39 |  -.7744335   .2568377    -3.02   0.003    -1.281393   -.2674739
         _Ivilid_40 |  -.2521779   .1272456    -1.98   0.049     -.503342   -.0010138
         _Ivilid_41 |  -.0921565   .0241005    -3.82   0.000    -.1397272   -.0445857
         _Ivilid_42 |  -.4964573   .0855612    -5.80   0.000    -.6653425   -.3275722
         _Ivilid_43 |  -.1892049   .0557122    -3.40   0.001    -.2991725   -.0792373
         _Ivilid_44 |  -.4370667   .0493147    -8.86   0.000    -.5344066   -.3397268
         _Ivilid_45 |   .0762798   .1288051     0.59   0.554    -.1779625     .330522
         _Ivilid_46 |  -.6627834   .2589636    -2.56   0.011    -1.173939   -.1516277
         _Ivilid_47 |  -.5284339   .2001188    -2.64   0.009    -.9234388    -.133429
              _cons |   .7946497   .3499352     2.27   0.024     .1039294     1.48537
-------------------------------------------------------------------------------------

. test intensive inter_intensive_day

 ( 1)  intensive = 0
 ( 2)  inter_intensive_day = 0

       F(  2,   172) =   15.02
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. 
. **********************************************************3. Social Network effect************************************************************
. gen inter_network_educ = network_rate_preintensive*intensive
(314 missing values generated)

. gen inter_network_educ1 = network_onlyone*intensive
(314 missing values generated)

. gen inter_network_educ2 = network_onlytwo*intensive
(314 missing values generated)

. gen inter_network_educ3 = network_twomore*intensive
(314 missing values generated)

. gen inter_inten_delay = intensive*delay

. 
. *2.1. Network rate - all sample
. *table 2, columns 2-5
. **check robustness by adding spillover effect from simple session**
. reg takeup_survey network_rate_preintensive male age agpop ricearea_2010 literacy intensive risk_averse disaster_prob friend* _Ivilid* if delay =
> = 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity.
note: friend2 omitted because of collinearity.
note: _Ivilid_5 omitted because of collinearity.
note: _Ivilid_23 omitted because of collinearity.
note: _Ivilid_27 omitted because of collinearity.

Linear regression                               Number of obs     =      1,255
                                                F(51, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1193
                                                Root MSE          =      .4759

                                           (Std. err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .2911852   .0820022     3.55   0.001     .1292763    .4530942
                     male |   .0156732   .0737808     0.21   0.832    -.1300031    .1613494
                      age |   .0045023   .0012086     3.73   0.000     .0021161    .0068886
                    agpop |  -.0101567   .0068682    -1.48   0.141    -.0237175    .0034041
            ricearea_2010 |   .0043143    .001025     4.21   0.000     .0022904    .0063382
                 literacy |   .0874332    .032683     2.68   0.008     .0229025    .1519639
                intensive |   .0298357   .0332218     0.90   0.370     -.035759    .0954303
              risk_averse |   .1091701   .0489645     2.23   0.027     .0124924    .2058478
            disaster_prob |   .0019402   .0008009     2.42   0.017     .0003588    .0035216
                  friend1 |          0  (omitted)
                  friend2 |          0  (omitted)
                  friend3 |   .1210273   .2237249     0.54   0.589    -.3207053    .5627599
                  friend4 |   .1813803   .1294373     1.40   0.163    -.0741867    .4369473
                  friend5 |   .3201854   .0648817     4.93   0.000     .1920799    .4482908
                _Ivilid_2 |  -.4624467    .143032    -3.23   0.001    -.7448556   -.1800378
                _Ivilid_3 |  -.2993164   .0652264    -4.59   0.000    -.4281023   -.1705306
                _Ivilid_4 |  -.1577358   .0550264    -2.87   0.005    -.2663826   -.0490891
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |   .0563637   .1465408     0.38   0.701    -.2329731    .3457006
                _Ivilid_7 |  -.1299139   .0731729    -1.78   0.078    -.2743899     .014562
                _Ivilid_8 |  -.0961288   .0790676    -1.22   0.226    -.2522435    .0599859
                _Ivilid_9 |  -.2133536   .1395284    -1.53   0.128    -.4888448    .0621376
               _Ivilid_10 |  -.1302201   .0835006    -1.56   0.121    -.2950876    .0346473
               _Ivilid_11 |  -.2074857   .0647209    -3.21   0.002    -.3352736   -.0796978
               _Ivilid_12 |  -.0153145   .1037764    -0.15   0.883    -.2202153    .1895864
               _Ivilid_13 |  -.0521824   .0644859    -0.81   0.420    -.1795062    .0751414
               _Ivilid_14 |  -.2995046   .0844105    -3.55   0.001    -.4661686   -.1328406
               _Ivilid_15 |   .1254477   .1080595     1.16   0.247    -.0879098    .3388053
               _Ivilid_16 |  -.0233146   .0225019    -1.04   0.302    -.0677433    .0211142
               _Ivilid_17 |  -.3063526   .0638903    -4.79   0.000    -.4325005   -.1802046
               _Ivilid_18 |  -.0602414   .1693432    -0.36   0.722    -.3946003    .2741175
               _Ivilid_19 |  -.3395754   .0796093    -4.27   0.000    -.4967596   -.1823912
               _Ivilid_20 |  -.0363957   .0904436    -0.40   0.688    -.2149717    .1421802
               _Ivilid_21 |   -.255359   .0780348    -3.27   0.001    -.4094345   -.1012835
               _Ivilid_22 |  -.1906716   .1137607    -1.68   0.096     -.415286    .0339427
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.1013682   .1376443    -0.74   0.463    -.3731394     .170403
               _Ivilid_25 |   .1128429   .1552555     0.73   0.468    -.1937006    .4193865
               _Ivilid_26 |  -.1311839   .0352068    -3.73   0.000    -.2006978     -.06167
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |   -.040171   .0812866    -0.49   0.622    -.2006671     .120325
               _Ivilid_29 |  -.3268255   .0838619    -3.90   0.000    -.4924064   -.1612447
               _Ivilid_30 |  -.2284594   .1422666    -1.61   0.110    -.5093571    .0524383
               _Ivilid_31 |  -.1994708    .015103   -13.21   0.000    -.2292908   -.1696508
               _Ivilid_32 |    .069771   .0871249     0.80   0.424    -.1022523    .2417944
               _Ivilid_33 |  -.0325351    .042622    -0.76   0.446    -.1166899    .0516197
               _Ivilid_34 |  -.0451392   .2087275    -0.22   0.829    -.4572602    .3669818
               _Ivilid_35 |  -.3740458   .0186026   -20.11   0.000    -.4107756   -.3373159
               _Ivilid_36 |  -.3602062    .097654    -3.69   0.000    -.5530188   -.1673937
               _Ivilid_37 |  -.1770161   .0221741    -7.98   0.000    -.2207976   -.1332346
               _Ivilid_38 |  -.1280958   .1956103    -0.65   0.513    -.5143176     .258126
               _Ivilid_39 |  -.1381876   .1328476    -1.04   0.300    -.4004879    .1241127
               _Ivilid_40 |  -.2851302   .1514275    -1.88   0.061    -.5841155    .0138551
               _Ivilid_41 |  -.1748761   .0961413    -1.82   0.071     -.364702    .0149497
               _Ivilid_42 |  -.2852972   .0442582    -6.45   0.000    -.3726826   -.1979117
               _Ivilid_43 |    .422464    .028734    14.70   0.000     .3657303    .4791977
               _Ivilid_44 |  -.1111072   .1141388    -0.97   0.332     -.336468    .1142537
               _Ivilid_45 |   .0768297   .0891676     0.86   0.390     -.099227    .2528863
               _Ivilid_46 |  -.2941174   .0341094    -8.62   0.000    -.3614646   -.2267703
               _Ivilid_47 |  -.2635088   .0685471    -3.84   0.000    -.3988513   -.1281663
                    _cons |  -.1674247   .1031443    -1.62   0.106    -.3710774    .0362281
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. reg takeup_survey network_rate_preintensive network_rate_presimple intensive friend* _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity.
note: friend3 omitted because of collinearity.
note: _Ivilid_5 omitted because of collinearity.
note: _Ivilid_23 omitted because of collinearity.
note: _Ivilid_32 omitted because of collinearity.

Linear regression                               Number of obs     =      1,274
                                                F(45, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0913
                                                Root MSE          =     .48223

                                           (Std. err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .2780891   .0844643     3.29   0.001      .111319    .4448592
   network_rate_presimple |  -.1079451     .09329    -1.16   0.249    -.2921412     .076251
                intensive |   .0256236   .0330547     0.78   0.439    -.0396411    .0908882
                  friend1 |          0  (omitted)
                  friend2 |   -.265184   .2325179    -1.14   0.256    -.7242779    .1939099
                  friend3 |          0  (omitted)
                  friend4 |   .0671916   .2370514     0.28   0.777    -.4008535    .5352368
                  friend5 |   .1924117    .229564     0.84   0.403      -.26085    .6456733
                _Ivilid_2 |  -.5170619   .1452846    -3.56   0.000    -.8039184   -.2302054
                _Ivilid_3 |  -.3347716   .0928574    -3.61   0.000    -.5181134   -.1514298
                _Ivilid_4 |  -.2915162   .0883575    -3.30   0.001    -.4659732   -.1170592
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |  -.0697833   .1989348    -0.35   0.726    -.4625692    .3230026
                _Ivilid_7 |  -.2379635   .0898406    -2.65   0.009    -.4153489    -.060578
                _Ivilid_8 |  -.1417428   .0995431    -1.42   0.156    -.3382854    .0547997
                _Ivilid_9 |  -.3354236   .1477278    -2.27   0.024    -.6271041   -.0437432
               _Ivilid_10 |  -.0788618   .0689277    -1.14   0.254    -.2149557    .0572322
               _Ivilid_11 |  -.3090739   .0842816    -3.67   0.000    -.4754832   -.1426645
               _Ivilid_12 |  -.1166139   .1208105    -0.97   0.336    -.3551477    .1219198
               _Ivilid_13 |  -.1217668   .1071588    -1.14   0.257     -.333346    .0898124
               _Ivilid_14 |  -.3541568   .1054506    -3.36   0.001    -.5623632   -.1459504
               _Ivilid_15 |   .0422508    .123248     0.34   0.732    -.2010956    .2855972
               _Ivilid_16 |  -.0596282   .0601764    -0.99   0.323    -.1784432    .0591869
               _Ivilid_17 |  -.3722175   .0891721    -4.17   0.000    -.5482829   -.1961521
               _Ivilid_18 |   -.109569   .1714964    -0.64   0.524    -.4481794    .2290413
               _Ivilid_19 |  -.3717859   .0944744    -3.94   0.000    -.5583204   -.1852513
               _Ivilid_20 |  -.1243429   .1065748    -1.17   0.245     -.334769    .0860832
               _Ivilid_21 |  -.3202348   .0933012    -3.43   0.001     -.504453   -.1360165
               _Ivilid_22 |  -.2714403   .1374244    -1.98   0.050    -.5427773   -.0001032
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.1778438   .1517523    -1.17   0.243    -.4774703    .1217828
               _Ivilid_25 |   .0628728   .1646032     0.38   0.703    -.2621273    .3878729
               _Ivilid_26 |  -.2454443   .0735551    -3.34   0.001    -.3906749   -.1002136
               _Ivilid_27 |  -.0442324   .0590468    -0.75   0.455    -.1608172    .0723524
               _Ivilid_28 |  -.1500101   .1067349    -1.41   0.162    -.3607523    .0607322
               _Ivilid_29 |  -.3718116   .1108892    -3.35   0.001    -.5907564   -.1528669
               _Ivilid_30 |  -.3566179   .1611685    -2.21   0.028    -.6748363   -.0383995
               _Ivilid_31 |  -.3142907   .0594733    -5.28   0.000    -.4317174    -.196864
               _Ivilid_32 |          0  (omitted)
               _Ivilid_33 |  -.0894852   .0641825    -1.39   0.165    -.2162101    .0372396
               _Ivilid_34 |  -.1502263   .2063923    -0.73   0.468    -.5577366     .257284
               _Ivilid_35 |  -.4050362   .0659627    -6.14   0.000    -.5352761   -.2747964
               _Ivilid_36 |  -.4462711   .1195196    -3.73   0.000    -.6822561   -.2102861
               _Ivilid_37 |  -.2614215   .0632067    -4.14   0.000    -.3862196   -.1366233
               _Ivilid_38 |  -.1747955   .2139511    -0.82   0.415    -.5972303    .2476393
               _Ivilid_39 |  -.2172706   .1838694    -1.18   0.239    -.5803108    .1457695
               _Ivilid_40 |  -.3544703    .167627    -2.11   0.036    -.6854408   -.0234999
               _Ivilid_41 |  -.2346066   .0915869    -2.56   0.011    -.4154399   -.0537733
               _Ivilid_42 |  -.3600809   .0692713    -5.20   0.000    -.4968532   -.2233085
               _Ivilid_43 |   .3449623    .061654     5.60   0.000     .2232298    .4666947
               _Ivilid_44 |  -.2069951    .111044    -1.86   0.064    -.4262455    .0122553
               _Ivilid_45 |   .0021027   .1169405     0.02   0.986    -.2287899    .2329953
               _Ivilid_46 |  -.3703334   .0708309    -5.23   0.000    -.5101851   -.2304816
               _Ivilid_47 |    -.33559   .0922789    -3.64   0.000    -.5177896   -.1533903
                    _cons |   .4565817   .2415535     1.89   0.060    -.0203526    .9335161
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. reg takeup_survey network_rate_preintensive intensive inter_network_educ male age agpop ricearea_2010 literacy risk_averse disaster_prob friend* 
> _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity.
note: friend2 omitted because of collinearity.
note: _Ivilid_5 omitted because of collinearity.
note: _Ivilid_23 omitted because of collinearity.
note: _Ivilid_27 omitted because of collinearity.

Linear regression                               Number of obs     =      1,255
                                                F(52, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1226
                                                Root MSE          =      .4752

                                           (Std. err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .4444749   .1089443     4.08   0.000     .2293703    .6595796
                intensive |   .0809232   .0397319     2.04   0.043     .0024747    .1593716
       inter_network_educ |   -.328592    .160919    -2.04   0.043    -.6463178   -.0108663
                     male |   .0186269   .0740731     0.25   0.802    -.1276265    .1648802
                      age |   .0045921   .0012054     3.81   0.000     .0022121     .006972
                    agpop |  -.0102751    .006836    -1.50   0.135    -.0237724    .0032222
            ricearea_2010 |   .0043351   .0010269     4.22   0.000     .0023074    .0063627
                 literacy |   .0871877   .0326466     2.67   0.008     .0227287    .1516467
              risk_averse |   .1047806   .0488233     2.15   0.033     .0083818    .2011795
            disaster_prob |   .0019153   .0008007     2.39   0.018     .0003343    .0034963
                  friend1 |          0  (omitted)
                  friend2 |          0  (omitted)
                  friend3 |   .1221102   .2394622     0.51   0.611    -.3506948    .5949153
                  friend4 |   .1775006   .1472125     1.21   0.230    -.1131626    .4681637
                  friend5 |   .3147423   .0937711     3.36   0.001     .1295964    .4998883
                _Ivilid_2 |  -.4475949   .1448785    -3.09   0.002    -.7336496   -.1615401
                _Ivilid_3 |  -.2845492   .0647171    -4.40   0.000    -.4123297   -.1567687
                _Ivilid_4 |  -.1345709   .0560517    -2.40   0.017    -.2452419   -.0238998
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |   .0817074   .1546839     0.53   0.598    -.2237075    .3871224
                _Ivilid_7 |   -.109223   .0729305    -1.50   0.136    -.2532203    .0347744
                _Ivilid_8 |  -.0828196   .0813464    -1.02   0.310    -.2434336    .0777944
                _Ivilid_9 |  -.2064473   .1359317    -1.52   0.131    -.4748371    .0619426
               _Ivilid_10 |  -.1079498   .0845951    -1.28   0.204    -.2749783    .0590787
               _Ivilid_11 |  -.1910258   .0654892    -2.92   0.004    -.3203307   -.0617209
               _Ivilid_12 |   .0007518    .103284     0.01   0.994    -.2031768    .2046804
               _Ivilid_13 |  -.0390839   .0651383    -0.60   0.549    -.1676959    .0895281
               _Ivilid_14 |   -.280998   .0862847    -3.26   0.001    -.4513624   -.1106336
               _Ivilid_15 |   .1448569   .0989728     1.46   0.145    -.0505595    .3402733
               _Ivilid_16 |   -.005519   .0237874    -0.23   0.817     -.052486     .041448
               _Ivilid_17 |  -.2846395   .0637101    -4.47   0.000    -.4104317   -.1588473
               _Ivilid_18 |  -.0299112   .1767254    -0.17   0.866    -.3788459    .3190235
               _Ivilid_19 |  -.3189339   .0773467    -4.12   0.000    -.4716508    -.166217
               _Ivilid_20 |  -.0210646   .0908662    -0.23   0.817     -.200475    .1583457
               _Ivilid_21 |  -.2404617   .0762463    -3.15   0.002    -.3910059   -.0899176
               _Ivilid_22 |  -.1672806   .1105887    -1.51   0.132    -.3856319    .0510708
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.0810271    .134225    -0.60   0.547     -.346047    .1839928
               _Ivilid_25 |   .1302694   .1539617     0.85   0.399    -.1737197    .4342585
               _Ivilid_26 |  -.1137612   .0380654    -2.99   0.003    -.1889193   -.0386031
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |  -.0184491   .0777992    -0.24   0.813    -.1720594    .1351613
               _Ivilid_29 |  -.3079594   .0858579    -3.59   0.000    -.4774813   -.1384376
               _Ivilid_30 |  -.2117678   .1411173    -1.50   0.135    -.4903962    .0668606
               _Ivilid_31 |  -.1856843   .0159698   -11.63   0.000    -.2172158   -.1541528
               _Ivilid_32 |   .0842695   .0909274     0.93   0.355    -.0952617    .2638008
               _Ivilid_33 |  -.0039789   .0366365    -0.11   0.914    -.0763157    .0683578
               _Ivilid_34 |  -.0392469   .2148119    -0.18   0.855    -.4633812    .3848874
               _Ivilid_35 |  -.3540522   .0208347   -16.99   0.000    -.3951892   -.3129153
               _Ivilid_36 |   -.334712   .0974004    -3.44   0.001    -.5270239   -.1424001
               _Ivilid_37 |  -.1569619   .0238918    -6.57   0.000    -.2041349   -.1097889
               _Ivilid_38 |  -.1004503    .195002    -0.52   0.607    -.4854711    .2845704
               _Ivilid_39 |  -.1165906   .1236872    -0.94   0.347    -.3608043    .1276232
               _Ivilid_40 |  -.2701749   .1470304    -1.84   0.068    -.5604785    .0201286
               _Ivilid_41 |  -.1468868   .0942757    -1.56   0.121     -.333029    .0392555
               _Ivilid_42 |  -.2737173   .0424413    -6.45   0.000    -.3575153   -.1899193
               _Ivilid_43 |   .4307949   .0324247    13.29   0.000     .3667742    .4948156
               _Ivilid_44 |  -.0967959   .1151307    -0.84   0.402    -.3241152    .1305234
               _Ivilid_45 |   .0952797   .0915862     1.04   0.300    -.0855522    .2761116
               _Ivilid_46 |  -.2776361   .0364792    -7.61   0.000    -.3496622   -.2056099
               _Ivilid_47 |  -.2499718   .0650632    -3.84   0.000    -.3784357    -.121508
                    _cons |  -.2093469   .1181326    -1.77   0.078    -.4425934    .0238996
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. test network_rate_preintensive inter_network_educ

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_network_educ = 0

       F(  2,   165) =    8.68
            Prob > F =    0.0003

. test intensive inter_network_educ

 ( 1)  intensive = 0
 ( 2)  inter_network_educ = 0

       F(  2,   165) =    2.68
            Prob > F =    0.0718

. reg takeup_survey network_onlyone network_onlytwo network_twomore intensive inter_network_educ1 inter_network_educ2 inter_network_educ3 male age 
> agpop ricearea_2010 literacy risk_averse disaster_prob friend* _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity.
note: friend2 omitted because of collinearity.
note: _Ivilid_5 omitted because of collinearity.
note: _Ivilid_23 omitted because of collinearity.
note: _Ivilid_27 omitted because of collinearity.

Linear regression                               Number of obs     =      1,255
                                                F(56, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1287
                                                Root MSE          =     .47433

                                     (Std. err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
    network_onlyone |   .0969821   .0424851     2.28   0.024     .0130976    .1808666
    network_onlytwo |    .177096   .1114581     1.59   0.114    -.0429719    .3971638
    network_twomore |   .1369322   .0916141     1.49   0.137     -.043955    .3178193
          intensive |   .0935944   .0419079     2.23   0.027     .0108495    .1763394
inter_network_educ1 |  -.0869055   .0551442    -1.58   0.117    -.1957847    .0219737
inter_network_educ2 |  -.0907766    .192624    -0.47   0.638    -.4711022    .2895489
inter_network_educ3 |  -.1405079   .1738363    -0.81   0.420    -.4837383    .2027225
               male |   .0292083   .0729577     0.40   0.689    -.1148428    .1732594
                age |   .0046181   .0012251     3.77   0.000     .0021992     .007037
              agpop |  -.0083813   .0068516    -1.22   0.223    -.0219094    .0051468
      ricearea_2010 |   .0044333   .0010307     4.30   0.000     .0023982    .0064684
           literacy |   .0901466   .0327411     2.75   0.007     .0255011    .1547921
        risk_averse |   .1037422   .0493319     2.10   0.037     .0063391    .2011453
      disaster_prob |   .0016982    .000812     2.09   0.038     .0000951    .0033014
            friend1 |          0  (omitted)
            friend2 |          0  (omitted)
            friend3 |   .0639547   .2357249     0.27   0.786    -.4014713    .5293807
            friend4 |   .0958195   .1307932     0.73   0.465    -.1624247    .3540636
            friend5 |   .2193946   .0711592     3.08   0.002     .0788946    .3598946
          _Ivilid_2 |  -.4108686   .1346199    -3.05   0.003    -.6766682    -.145069
          _Ivilid_3 |   -.249323   .0651857    -3.82   0.000    -.3780287   -.1206174
          _Ivilid_4 |  -.1011312   .0649444    -1.56   0.121    -.2293603    .0270979
          _Ivilid_5 |          0  (omitted)
          _Ivilid_6 |   .1297553   .1533846     0.85   0.399    -.1730943    .4326048
          _Ivilid_7 |  -.0662337   .0716677    -0.92   0.357    -.2077377    .0752703
          _Ivilid_8 |  -.0156161     .08446    -0.18   0.854    -.1823777    .1511456
          _Ivilid_9 |   -.142434   .1395221    -1.02   0.309    -.4179128    .1330447
         _Ivilid_10 |  -.0551596   .1036052    -0.53   0.595    -.2597225    .1494033
         _Ivilid_11 |  -.1314217    .069607    -1.89   0.061    -.2688569    .0060135
         _Ivilid_12 |   .0457866   .1092103     0.42   0.676    -.1698432    .2614165
         _Ivilid_13 |  -.0082238   .0661459    -0.12   0.901    -.1388254    .1223778
         _Ivilid_14 |  -.2363806   .0897347    -2.63   0.009    -.4135569   -.0592042
         _Ivilid_15 |   .2091902   .1147166     1.82   0.070    -.0173115    .4356919
         _Ivilid_16 |   .0398187   .0343252     1.16   0.248    -.0279545    .1075919
         _Ivilid_17 |  -.2410564    .064022    -3.77   0.000    -.3674642   -.1146485
         _Ivilid_18 |    .020932   .1722306     0.12   0.903     -.319128    .3609919
         _Ivilid_19 |  -.2824804   .0794384    -3.56   0.000    -.4393272   -.1256336
         _Ivilid_20 |   .0189951    .092965     0.20   0.838    -.1645592    .2025494
         _Ivilid_21 |  -.2070614   .0691073    -3.00   0.003      -.34351   -.0706129
         _Ivilid_22 |  -.1179937   .1127395    -1.05   0.297    -.3405917    .1046042
         _Ivilid_23 |          0  (omitted)
         _Ivilid_24 |  -.0175169    .140589    -0.12   0.901    -.2951021    .2600683
         _Ivilid_25 |   .1864604   .1541932     1.21   0.228    -.1179857    .4909066
         _Ivilid_26 |  -.0936103   .0415035    -2.26   0.025    -.1755567    -.011664
         _Ivilid_27 |          0  (omitted)
         _Ivilid_28 |   .0321785   .0840412     0.38   0.702    -.1337563    .1981132
         _Ivilid_29 |  -.2705404   .0925504    -2.92   0.004     -.453276   -.0878047
         _Ivilid_30 |  -.1601366   .1426763    -1.12   0.263    -.4418432      .12157
         _Ivilid_31 |  -.1472723   .0227059    -6.49   0.000    -.1921039   -.1024407
         _Ivilid_32 |   .1544013   .0891602     1.73   0.085    -.0216406    .3304432
         _Ivilid_33 |   .0479637   .0417186     1.15   0.252    -.0344073    .1303348
         _Ivilid_34 |  -.0133661   .2248879    -0.06   0.953     -.457395    .4306628
         _Ivilid_35 |  -.3009263   .0338579    -8.89   0.000    -.3677769   -.2340758
         _Ivilid_36 |  -.3023035   .1019418    -2.97   0.003    -.5035821   -.1010249
         _Ivilid_37 |  -.1113482   .0315537    -3.53   0.001    -.1736492   -.0490472
         _Ivilid_38 |  -.0360357   .1839279    -0.20   0.845    -.3991913      .32712
         _Ivilid_39 |  -.0664515   .1243406    -0.53   0.594    -.3119553    .1790523
         _Ivilid_40 |  -.2249663   .1540153    -1.46   0.146    -.5290612    .0791286
         _Ivilid_41 |  -.1045148   .0896633    -1.17   0.245    -.2815501    .0725204
         _Ivilid_42 |  -.2134265   .0510639    -4.18   0.000    -.3142494   -.1126036
         _Ivilid_43 |   .4815171   .0376199    12.80   0.000     .4072388    .5557955
         _Ivilid_44 |  -.0526524   .1112004    -0.47   0.636    -.2722114    .1669067
         _Ivilid_45 |    .143208   .0971813     1.47   0.142    -.0486713    .3350873
         _Ivilid_46 |  -.2356783    .040023    -5.89   0.000    -.3147015    -.156655
         _Ivilid_47 |  -.2101928   .0685947    -3.06   0.003    -.3456293   -.0747563
              _cons |  -.1881967   .1018169    -1.85   0.066    -.3892286    .0128353
-------------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. 
. gen nofriend = 1

. replace nofriend = 0 if delay == 1 & info_none == 1 & network_yes == 1
(683 real changes made)

. *2.2. test spillover effect from non-friends
. *table2, column 6
. reg takeup_survey intensive delay inter_inten_delay male age agpop ricearea_2010 literacy risk_averse disaster_prob _Ivilid* if delay == 0 | (del
> ay == 1 & info_none == 1 & nofriend == 1), cluster(address)

Linear regression                               Number of obs     =      2,756
                                                F(52, 172)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1072
                                                Root MSE          =     .47299

                                   (Std. err. adjusted for 173 clusters in address)
-----------------------------------------------------------------------------------
                  |               Robust
    takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        intensive |   .1403269   .0259038     5.42   0.000     .0891966    .1914572
            delay |   .0317972   .0362454     0.88   0.382    -.0397458    .1033403
inter_inten_delay |  -.0525256   .0467534    -1.12   0.263    -.1448099    .0397587
             male |   .0480664   .0416527     1.15   0.250    -.0341499    .1302828
              age |   .0023435   .0009131     2.57   0.011     .0005411    .0041459
            agpop |  -.0044836   .0048757    -0.92   0.359    -.0141075    .0051403
    ricearea_2010 |   .0011529   .0007719     1.49   0.137    -.0003707    .0026765
         literacy |   .0625757   .0225257     2.78   0.006     .0181132    .1070382
      risk_averse |   .0720106   .0306167     2.35   0.020     .0115777    .1324435
    disaster_prob |   .0001667   .0005875     0.28   0.777    -.0009929    .0013263
        _Ivilid_2 |  -.4191927   .1197146    -3.50   0.001    -.6554917   -.1828937
        _Ivilid_3 |  -.2272989   .0590425    -3.85   0.000    -.3438401   -.1107577
        _Ivilid_4 |  -.2730082   .0596259    -4.58   0.000     -.390701   -.1553155
        _Ivilid_5 |  -.1679513   .1496356    -1.12   0.263    -.4633099    .1274072
        _Ivilid_6 |   .1714305   .0378353     4.53   0.000     .0967491    .2461118
        _Ivilid_7 |  -.2783659   .0425506    -6.54   0.000    -.3623544   -.1943774
        _Ivilid_8 |  -.1923783   .1031435    -1.87   0.064    -.3959684    .0112118
        _Ivilid_9 |  -.2407098   .1055517    -2.28   0.024    -.4490533   -.0323663
       _Ivilid_10 |  -.1514583   .0993653    -1.52   0.129    -.3475908    .0446742
       _Ivilid_11 |  -.1688292   .0512959    -3.29   0.001    -.2700798   -.0675786
       _Ivilid_12 |  -.0011707   .0957109    -0.01   0.990      -.19009    .1877486
       _Ivilid_13 |      -.006   .0791854    -0.08   0.940    -.1623002    .1503002
       _Ivilid_14 |  -.2220805   .0819122    -2.71   0.007    -.3837631   -.0603979
       _Ivilid_15 |   .1058526   .0823051     1.29   0.200    -.0566054    .2683106
       _Ivilid_16 |  -.4257579   .0153719   -27.70   0.000    -.4560998    -.395416
       _Ivilid_17 |  -.3942722   .0640323    -6.16   0.000    -.5206624   -.2678819
       _Ivilid_18 |  -.0939815   .0734668    -1.28   0.203    -.2389941     .051031
       _Ivilid_19 |  -.3046031   .0617228    -4.94   0.000    -.4264347   -.1827714
       _Ivilid_20 |  -.1372601    .104844    -1.31   0.192    -.3442066    .0696865
       _Ivilid_21 |  -.2844593   .0443675    -6.41   0.000    -.3720341   -.1968844
       _Ivilid_22 |  -.2846745    .132013    -2.16   0.032    -.5452487   -.0241003
       _Ivilid_23 |  -.2716647   .1098468    -2.47   0.014    -.4884859   -.0548434
       _Ivilid_24 |  -.1284568   .1031228    -1.25   0.215     -.332006    .0750924
       _Ivilid_25 |   .0360313   .0490816     0.73   0.464    -.0608484     .132911
       _Ivilid_26 |   .0205876   .0997737     0.21   0.837     -.176351    .2175261
       _Ivilid_27 |   -.155377   .0637348    -2.44   0.016    -.2811801    -.029574
       _Ivilid_28 |   .0218129   .0717003     0.30   0.761    -.1197129    .1633387
       _Ivilid_29 |  -.3652692   .0644646    -5.67   0.000    -.4925127   -.2380257
       _Ivilid_30 |  -.2935357   .0738758    -3.97   0.000    -.4393556   -.1477158
       _Ivilid_31 |  -.0002777   .0198891    -0.01   0.989    -.0395358    .0389803
       _Ivilid_32 |   .2026638   .0874193     2.32   0.022      .030111    .3752166
       _Ivilid_33 |   .0849835   .1172704     0.72   0.470    -.1464909     .316458
       _Ivilid_34 |  -.3094035   .1354611    -2.28   0.024    -.5767837   -.0420232
       _Ivilid_35 |  -.2197439   .0127285   -17.26   0.000    -.2448681   -.1946197
       _Ivilid_36 |  -.2082179   .0234607    -8.88   0.000    -.2545259   -.1619099
       _Ivilid_37 |  -.2721439   .0824854    -3.30   0.001    -.4349579   -.1093299
       _Ivilid_38 |   .0132964   .0385656     0.34   0.731    -.0628264    .0894191
       _Ivilid_39 |  -.4139016    .027058   -15.30   0.000      -.46731   -.3604932
       _Ivilid_40 |  -.1610064     .07723    -2.08   0.039    -.3134471   -.0085657
       _Ivilid_41 |   -.096842   .0440867    -2.20   0.029    -.1838626   -.0098214
       _Ivilid_42 |  -.3705229    .047119    -7.86   0.000    -.4635287    -.277517
       _Ivilid_43 |   .0125913   .0595598     0.21   0.833     -.104971    .1301536
       _Ivilid_44 |  -.4004385   .0351585   -11.39   0.000    -.4698362   -.3310408
       _Ivilid_45 |   .0087315   .0844402     0.10   0.918    -.1579409    .1754039
       _Ivilid_46 |  -.3363034   .0581305    -5.79   0.000    -.4510444   -.2215624
       _Ivilid_47 |  -.3108602   .0614448    -5.06   0.000    -.4321431   -.1895773
            _cons |   .3325853    .079483     4.18   0.000     .1756975     .489473
-----------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. test intensive inter_inten_delay

 ( 1)  intensive = 0
 ( 2)  inter_inten_delay = 0

       F(  2,   172) =   16.69
            Prob > F =    0.0000

. 
. *2.3. Alternative measures and nonlinear effect
. *table 3
. local outputfile2 Table3.xls

. reg takeup_survey network_twoside male age agpop ricearea_2010 literacy intensive risk_averse disaster_prob friend* _Ivilid* if delay == 1 & info
> _none == 1, cluster(address)
note: friend1 omitted because of collinearity.
note: friend2 omitted because of collinearity.
note: _Ivilid_5 omitted because of collinearity.
note: _Ivilid_23 omitted because of collinearity.
note: _Ivilid_27 omitted because of collinearity.

Linear regression                               Number of obs     =      1,255
                                                F(51, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1127
                                                Root MSE          =     .47766

                                 (Std. err. adjusted for 166 clusters in address)
---------------------------------------------------------------------------------
                |               Robust
  takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
network_twoside |   .4003157   .1727367     2.32   0.022     .0592565    .7413749
           male |   .0158313   .0729849     0.22   0.829    -.1282735     .159936
            age |   .0045619   .0012537     3.64   0.000     .0020866    .0070372
          agpop |   -.009707   .0070101    -1.38   0.168    -.0235481    .0041341
  ricearea_2010 |   .0041592    .001002     4.15   0.000     .0021808    .0061375
       literacy |   .0803797   .0330053     2.44   0.016     .0152125     .145547
      intensive |   .0245081   .0331752     0.74   0.461    -.0409945    .0900106
    risk_averse |   .1105594   .0486692     2.27   0.024     .0144648     .206654
  disaster_prob |   .0019885   .0008106     2.45   0.015      .000388    .0035891
        friend1 |          0  (omitted)
        friend2 |          0  (omitted)
        friend3 |   .1193774   .2587278     0.46   0.645    -.3914666    .6302213
        friend4 |   .1648759   .1706251     0.97   0.335    -.1720142    .5017659
        friend5 |   .3037102    .126707     2.40   0.018     .0535342    .5538862
      _Ivilid_2 |  -.4976289   .1440066    -3.46   0.001    -.7819621   -.2132958
      _Ivilid_3 |  -.3315304   .0615265    -5.39   0.000     -.453011   -.2100497
      _Ivilid_4 |   -.178892   .0466062    -3.84   0.000    -.2709134   -.0868706
      _Ivilid_5 |          0  (omitted)
      _Ivilid_6 |   .0150661   .1501091     0.10   0.920    -.2813161    .3114483
      _Ivilid_7 |  -.1457189   .0785378    -1.86   0.065    -.3007875    .0093498
      _Ivilid_8 |  -.1082253   .0718947    -1.51   0.134    -.2501774    .0337268
      _Ivilid_9 |  -.2373499   .1392499    -1.70   0.090    -.5122911    .0375914
     _Ivilid_10 |  -.1579952   .0814824    -1.94   0.054    -.3188778    .0028875
     _Ivilid_11 |   -.240614   .0649514    -3.70   0.000     -.368857   -.1123709
     _Ivilid_12 |  -.0314251   .1054307    -0.30   0.766    -.2395922     .176742
     _Ivilid_13 |  -.0720337   .0578581    -1.25   0.215    -.1862713     .042204
     _Ivilid_14 |  -.3348289   .0854975    -3.92   0.000    -.5036391   -.1660188
     _Ivilid_15 |   .0908461   .1000972     0.91   0.365    -.1067904    .2884826
     _Ivilid_16 |  -.0416201   .0232938    -1.79   0.076    -.0876123    .0043722
     _Ivilid_17 |  -.3296272   .0655763    -5.03   0.000     -.459104   -.2001504
     _Ivilid_18 |  -.0810466   .1800461    -0.45   0.653    -.4365378    .2744445
     _Ivilid_19 |  -.3682119   .0808112    -4.56   0.000    -.5277693   -.2086545
     _Ivilid_20 |  -.0640997   .0910647    -0.70   0.482    -.2439019    .1157025
     _Ivilid_21 |  -.2856804   .0845844    -3.38   0.001    -.4526877   -.1186731
     _Ivilid_22 |  -.2265559   .1164826    -1.94   0.053    -.4565445    .0034327
     _Ivilid_23 |          0  (omitted)
     _Ivilid_24 |  -.1280379   .1437748    -0.89   0.374    -.4119133    .1558375
     _Ivilid_25 |   .0650725   .1488589     0.44   0.663    -.2288413    .3589864
     _Ivilid_26 |  -.1627075   .0389302    -4.18   0.000    -.2395731   -.0858419
     _Ivilid_27 |          0  (omitted)
     _Ivilid_28 |  -.0777145    .077314    -1.01   0.316    -.2303668    .0749377
     _Ivilid_29 |  -.3372872   .0821768    -4.10   0.000    -.4995408   -.1750336
     _Ivilid_30 |  -.2747585   .1401985    -1.96   0.052    -.5515728    .0020557
     _Ivilid_31 |  -.2336297   .0171133   -13.65   0.000    -.2674191   -.1998403
     _Ivilid_32 |   .0269182    .082333     0.33   0.744    -.1356438    .1894802
     _Ivilid_33 |   -.043235   .0398549    -1.08   0.280    -.1219263    .0354564
     _Ivilid_34 |  -.0985171   .2227703    -0.44   0.659    -.5383649    .3413307
     _Ivilid_35 |    -.40234   .0163905   -24.55   0.000     -.434702   -.3699779
     _Ivilid_36 |  -.3865928   .0957609    -4.04   0.000    -.5756675    -.197518
     _Ivilid_37 |  -.2292572   .0227109   -10.09   0.000    -.2740986   -.1844159
     _Ivilid_38 |  -.1395057   .1799725    -0.78   0.439    -.4948516    .2158402
     _Ivilid_39 |  -.1869006    .124686    -1.50   0.136    -.4330864    .0592852
     _Ivilid_40 |  -.3106374   .1513631    -2.05   0.042    -.6094956   -.0117791
     _Ivilid_41 |  -.1750046   .0967511    -1.81   0.072    -.3660344    .0160252
     _Ivilid_42 |  -.3172604   .0497409    -6.38   0.000    -.4154712   -.2190497
     _Ivilid_43 |   .3681089   .0278621    13.21   0.000     .3130967    .4231211
     _Ivilid_44 |  -.1407155   .1247103    -1.13   0.261    -.3869493    .1055183
     _Ivilid_45 |   .0503368   .0882251     0.57   0.569    -.1238589    .2245325
     _Ivilid_46 |  -.3292605   .0352275    -9.35   0.000    -.3988153   -.2597056
     _Ivilid_47 |  -.2852555   .0684097    -4.17   0.000    -.4203267   -.1501843
          _cons |   -.087313    .142749    -0.61   0.542    -.3691631    .1945371
---------------------------------------------------------------------------------

. outreg2 using `outputfile2'
Table3.xls
dir : seeout

. reg takeup_survey network_second male age agpop ricearea_2010 literacy intensive risk_averse disaster_prob friend* _Ivilid* if delay == 1 & info_
> none == 1, cluster(address)
note: friend1 omitted because of collinearity.
note: friend2 omitted because of collinearity.
note: _Ivilid_5 omitted because of collinearity.
note: _Ivilid_23 omitted because of collinearity.
note: _Ivilid_32 omitted because of collinearity.

Linear regression                               Number of obs     =      1,247
                                                F(51, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1087
                                                Root MSE          =     .47888

                                (Std. err. adjusted for 166 clusters in address)
--------------------------------------------------------------------------------
               |               Robust
 takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
network_second |   .1799045   .1398635     1.29   0.200    -.0962485    .4560574
          male |   .0092792   .0767641     0.12   0.904    -.1422873    .1608458
           age |   .0044682   .0012574     3.55   0.000     .0019855    .0069509
         agpop |   -.009414   .0069782    -1.35   0.179    -.0231921    .0043641
 ricearea_2010 |   .0040657   .0010427     3.90   0.000      .002007    .0061243
      literacy |   .0850385   .0325608     2.61   0.010      .020749     .149328
     intensive |   .0260585   .0339662     0.77   0.444    -.0410058    .0931229
   risk_averse |   .1155741   .0493055     2.34   0.020     .0182231    .2129251
 disaster_prob |   .0019147   .0008155     2.35   0.020     .0003046    .0035248
       friend1 |          0  (omitted)
       friend2 |          0  (omitted)
       friend3 |   .0494521   .2444415     0.20   0.840    -.4331844    .5320885
       friend4 |   .0744817   .1243349     0.60   0.550    -.1710109    .3199743
       friend5 |   .2262501   .0575727     3.93   0.000      .112576    .3399242
     _Ivilid_2 |  -.5347636       .168    -3.18   0.002    -.8664704   -.2030568
     _Ivilid_3 |  -.3879572   .0985839    -3.94   0.000    -.5826058   -.1933086
     _Ivilid_4 |  -.2376042   .0923519    -2.57   0.011     -.419948   -.0552603
     _Ivilid_5 |          0  (omitted)
     _Ivilid_6 |  -.0202424   .1718596    -0.12   0.906    -.3595699     .319085
     _Ivilid_7 |     -.2145   .0969607    -2.21   0.028    -.4059435   -.0230565
     _Ivilid_8 |  -.1685739   .1044842    -1.61   0.109    -.3748722    .0377245
     _Ivilid_9 |  -.3042047   .1460189    -2.08   0.039    -.5925111   -.0158984
    _Ivilid_10 |  -.2010773   .1063184    -1.89   0.060    -.4109972    .0088427
    _Ivilid_11 |  -.3094542    .100094    -3.09   0.002    -.5070843   -.1118241
    _Ivilid_12 |  -.0954978   .1346273    -0.71   0.479    -.3613121    .1703165
    _Ivilid_13 |  -.1402408   .0833854    -1.68   0.094    -.3048807    .0243991
    _Ivilid_14 |  -.3914054   .1148428    -3.41   0.001    -.6181563   -.1646546
    _Ivilid_15 |   .0290985    .132324     0.22   0.826     -.232168     .290365
    _Ivilid_16 |  -.1164397   .0718509    -1.62   0.107    -.2583055     .025426
    _Ivilid_17 |  -.3910842    .099097    -3.95   0.000    -.5867458   -.1954227
    _Ivilid_18 |  -.1428891   .1846056    -0.77   0.440    -.5073827    .2216045
    _Ivilid_19 |  -.4172146    .109268    -3.82   0.000    -.6329582   -.2014709
    _Ivilid_20 |  -.1240146   .1171479    -1.06   0.291    -.3553169    .1072876
    _Ivilid_21 |  -.3456029   .1100863    -3.14   0.002    -.5629623   -.1282434
    _Ivilid_22 |  -.2741385   .1397924    -1.96   0.052     -.550151     .001874
    _Ivilid_23 |          0  (omitted)
    _Ivilid_24 |  -.1396857   .1670088    -0.84   0.404    -.4694354     .190064
    _Ivilid_25 |   .0186203   .1723604     0.11   0.914     -.321696    .3589365
    _Ivilid_26 |  -.2121059   .0786238    -2.70   0.008    -.3673443   -.0568675
    _Ivilid_27 |  -.0761455   .0768954    -0.99   0.324    -.2279713    .0756804
    _Ivilid_28 |  -.1376157   .0972556    -1.41   0.159    -.3296416    .0544103
    _Ivilid_29 |  -.3941838   .1135102    -3.47   0.001    -.6183035   -.1700642
    _Ivilid_30 |  -.3081078   .1670824    -1.84   0.067    -.6380028    .0217873
    _Ivilid_31 |  -.3156157   .0759617    -4.15   0.000     -.465598   -.1656335
    _Ivilid_32 |          0  (omitted)
    _Ivilid_33 |  -.1042622   .0836665    -1.25   0.214    -.2694572    .0609327
    _Ivilid_34 |  -.1570299   .2267884    -0.69   0.490    -.6048112    .2907513
    _Ivilid_35 |  -.4681445   .0725546    -6.45   0.000    -.6113997   -.3248894
    _Ivilid_36 |  -.4439828   .1175014    -3.78   0.000    -.6759829   -.2119828
    _Ivilid_37 |  -.2707923   .0780931    -3.47   0.001     -.424983   -.1166017
    _Ivilid_38 |  -.2048095    .198658    -1.03   0.304     -.597049    .1874299
    _Ivilid_39 |  -.2487425   .1551819    -1.60   0.111    -.5551406    .0576556
    _Ivilid_40 |  -.3644528   .1686003    -2.16   0.032    -.6973449   -.0315607
    _Ivilid_41 |  -.2399896   .1140195    -2.10   0.037     -.465115   -.0148642
    _Ivilid_42 |   -.363553   .0879904    -4.13   0.000    -.5372852   -.1898208
    _Ivilid_43 |   .3201976   .0824621     3.88   0.000     .1573806    .4830147
    _Ivilid_44 |  -.1997848   .1409446    -1.42   0.158    -.4780722    .0785027
    _Ivilid_45 |  -.0157817   .1213454    -0.13   0.897    -.2553717    .2238082
    _Ivilid_46 |  -.3884757   .0839287    -4.63   0.000    -.5541883   -.2227632
    _Ivilid_47 |  -.3417499   .1041386    -3.28   0.001     -.547366   -.1361338
         _cons |   .0368924   .1036403     0.36   0.722    -.1677398    .2415245
--------------------------------------------------------------------------------

. outreg2 using `outputfile2'
Table3.xls
dir : seeout

. reg takeup_survey network_onlyone network_onlytwo network_twomore male age agpop ricearea_2010 literacy intensive risk_averse disaster_prob frien
> d* _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity.
note: friend2 omitted because of collinearity.
note: _Ivilid_5 omitted because of collinearity.
note: _Ivilid_23 omitted because of collinearity.
note: _Ivilid_27 omitted because of collinearity.

Linear regression                               Number of obs     =      1,255
                                                F(53, 165)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1229
                                                Root MSE          =     .47532

                                 (Std. err. adjusted for 166 clusters in address)
---------------------------------------------------------------------------------
                |               Robust
  takeup_survey | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
network_onlyone |   .0531452   .0315233     1.69   0.094     -.009096    .1153863
network_onlytwo |   .1105086   .0818464     1.35   0.179    -.0510926    .2721098
network_twomore |   .0750393    .070789     1.06   0.291    -.0647298    .2148083
           male |   .0215778   .0732348     0.29   0.769    -.1230204     .166176
            age |   .0044863   .0012224     3.67   0.000     .0020727    .0068998
          agpop |  -.0089016   .0068582    -1.30   0.196    -.0224427    .0046395
  ricearea_2010 |   .0043561   .0010283     4.24   0.000     .0023259    .0063864
       literacy |   .0890687   .0327671     2.72   0.007      .024372    .1537655
      intensive |   .0251553    .033083     0.76   0.448    -.0401654    .0904759
    risk_averse |   .1091457   .0491475     2.22   0.028     .0121066    .2061847
  disaster_prob |   .0017922   .0008041     2.23   0.027     .0002046    .0033798
        friend1 |          0  (omitted)
        friend2 |          0  (omitted)
        friend3 |   .0518693   .2295619     0.23   0.822    -.4013881    .5051267
        friend4 |    .098232   .1280545     0.77   0.444    -.1546047    .3510687
        friend5 |   .2204511   .0658038     3.35   0.001      .090525    .3503772
      _Ivilid_2 |  -.4396058   .1337116    -3.29   0.001    -.7036121   -.1755994
      _Ivilid_3 |  -.2779983   .0661025    -4.21   0.000    -.4085141   -.1474825
      _Ivilid_4 |  -.1418739    .059547    -2.38   0.018    -.2594462   -.0243015
      _Ivilid_5 |          0  (omitted)
      _Ivilid_6 |   .0833515   .1414929     0.59   0.557    -.1960185    .3627215
      _Ivilid_7 |  -.1070281   .0736403    -1.45   0.148    -.2524268    .0383707
      _Ivilid_8 |  -.0520072   .0815074    -0.64   0.524    -.2129391    .1089246
      _Ivilid_9 |  -.1710392     .14421    -1.19   0.237     -.455774    .1136956
     _Ivilid_10 |  -.0942549   .1003159    -0.94   0.349    -.2923232    .1038134
     _Ivilid_11 |  -.1667545   .0679844    -2.45   0.015     -.300986    -.032523
     _Ivilid_12 |   .0111201   .1078897     0.10   0.918    -.2019022    .2241424
     _Ivilid_13 |  -.0312025   .0670201    -0.47   0.642      -.16353     .101125
     _Ivilid_14 |  -.2720699   .0860987    -3.16   0.002    -.4420671   -.1020726
     _Ivilid_15 |   .1632273   .1199429     1.36   0.175    -.0735935     .400048
     _Ivilid_16 |   .0030257   .0304968     0.10   0.921    -.0571885      .06324
     _Ivilid_17 |  -.2778286   .0629436    -4.41   0.000    -.4021073   -.1535499
     _Ivilid_18 |  -.0313994   .1584509    -0.20   0.843    -.3442521    .2814533
     _Ivilid_19 |  -.3177548   .0843332    -3.77   0.000    -.4842662   -.1512434
     _Ivilid_20 |  -.0087327   .0928551    -0.09   0.925    -.1920701    .1746046
     _Ivilid_21 |  -.2348121   .0734676    -3.20   0.002    -.3798698   -.0897543
     _Ivilid_22 |  -.1605372    .115947    -1.38   0.168    -.3894682    .0683939
     _Ivilid_23 |          0  (omitted)
     _Ivilid_24 |  -.0603569   .1427249    -0.42   0.673    -.3421595    .2214456
     _Ivilid_25 |   .1521801   .1536331     0.99   0.323    -.1511602    .4555204
     _Ivilid_26 |  -.1216798   .0385866    -3.15   0.002     -.197867   -.0454927
     _Ivilid_27 |          0  (omitted)
     _Ivilid_28 |  -.0117229   .0890566    -0.13   0.895    -.1875604    .1641146
     _Ivilid_29 |   -.301379   .0888245    -3.39   0.001    -.4767582   -.1259999
     _Ivilid_30 |   -.191916   .1430929    -1.34   0.182    -.4744451    .0906131
     _Ivilid_31 |  -.1814926   .0185918    -9.76   0.000     -.218201   -.1447842
     _Ivilid_32 |   .1112375   .0889449     1.25   0.213    -.0643794    .2868543
     _Ivilid_33 |   .0155188   .0409356     0.38   0.705    -.0653063    .0963439
     _Ivilid_34 |  -.0283388   .2159259    -0.13   0.896    -.4546727    .3979951
     _Ivilid_35 |  -.3389661   .0302679   -11.20   0.000    -.3987284   -.2792038
     _Ivilid_36 |  -.3435459   .1011667    -3.40   0.001     -.543294   -.1437977
     _Ivilid_37 |   -.150358   .0278946    -5.39   0.000    -.2054344   -.0952816
     _Ivilid_38 |  -.0850956   .1828322    -0.47   0.642    -.4460877    .2758966
     _Ivilid_39 |  -.1062848    .135541    -0.78   0.434    -.3739031    .1613336
     _Ivilid_40 |  -.2568408   .1569836    -1.64   0.104    -.5667964    .0531147
     _Ivilid_41 |  -.1515437   .0883505    -1.72   0.088    -.3259869    .0228995
     _Ivilid_42 |  -.2480331   .0508355    -4.88   0.000     -.348405   -.1476612
     _Ivilid_43 |   .4566513   .0323643    14.11   0.000     .3927497    .5205529
     _Ivilid_44 |  -.0826593   .1115177    -0.74   0.460    -.3028448    .1375263
     _Ivilid_45 |   .1106018   .0937615     1.18   0.240    -.0745251    .2957288
     _Ivilid_46 |  -.2684424    .035862    -7.49   0.000      -.33925   -.1976348
     _Ivilid_47 |  -.2379705   .0723052    -3.29   0.001    -.3807331   -.0952078
          _cons |  -.1052584   .0985511    -1.07   0.287    -.2998422    .0893254
---------------------------------------------------------------------------------

. outreg2 using `outputfile2'
Table3.xls
dir : seeout

. save temp, replace
(file temp.dta not found)
file temp.dta saved

. 
end of do-file

